## Understand Groupby in Pandas

In [14]:
#import dataset
import pandas as pd

df = pd.read_csv('../Data/loan_train.csv')
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [15]:
# Average Income of males and females
df.groupby(['Gender'])[['ApplicantIncome']].mean()

        ApplicantIncome
Gender
Female      4643.473214
Male        5446.460123

In [16]:
# Average loan amount for different property areas like urban, rural
df.groupby(['Property_Area'])[['LoanAmount']].mean()

               LoanAmount
Property_Area
Rural          152.260116
Semiurban      145.504386
Urban          142.198953

In [17]:
# Compare loan status of different education backgrounds
df.groupby(['Education'])[['Loan_Status']].count()

              Loan_Status
Education
Graduate              480
Not Graduate          134